#!/bin/sh
#############################################################################
#Author : happylay 安徽理工大学
#Created Time : 2020-01-07 11:49
#Environment：centos7
#############################################################################
#--------------------------------------------------------------------------------------
# 1.安装epel-release yum源
yum -y install epel-release

#--------------------------------------------------------------------------------------
# 2.安装ansible
yum -y install ansible
#--------------------------------------------------------------------------------------
# 3.实现多主机之间免密登录
ssh-keygen -t rsa -f /root/.ssh/id_rsa -N ''

echo '
------------------------------安装成功,请定义主机清单...-------------------------------
# 定义主机清单 /etc/ansible/hosts
#--------------------------------------------------------------------------------------
echo "

# 子节点1
[node1]
# 节点地址
192.168.0.2

# 子节点2
[node2]
# 节点地址
192.168.0.3

# 子节点3
[node3]
# 节点地址
192.168.0.4

# 主机-ansible
[master]
# 主机地址
192.168.0.1

# 节点
[node:children]
node1
node2
node3

# 变量
[node:vars]
# ansible_ssh_pass='happylay'
# ansible_ssh_user='happylay'
# ansible_connection=local

# 所有节点
[all:children]
master
node1
node2
node3

">> /etc/ansible/hosts
#--------------------------------------------------------------------------------------

'